import React from 'react';
import { Card, Row, Col } from 'react-bootstrap';
import '../App.css'
const stihovi = [
  {
    naslov: 'Пророковање о Васкрсу',
    tekst: '"Зато ми је срце усхићено, а биће моје томе се радује; цело моје тело почива спокојно,што ми душу нећеш препустити свету мртвих,нити дати да твој верни трули." (Псалам 16:9-10)',
    izvor: 'Псалам16:9-10'
  },
  {
    naslov: 'Анђео говори женама',
    tekst: '"А анђео одговарајући рече женама: Не бојте се ви;јер знам да Исуса распетога тражите.Није овде;јер устаде као што је казао.Ходите да видите место где је лежао Господ." (Матеј 28:5–6)',
    izvor: 'Матеј 28:5–6'
  },
  {
    naslov: 'Исус се јавља Марији',
    tekst: '"Исус јој рече Марија!Она, окренувши се рече му: Равуни,што ће рећи: Учитељу." (Јован 20:16)',
    izvor: 'Јован 20:16'
  },
  {
    naslov: 'Празан гроб',
    tekst: '"А, у први дан седмице дође Марија Магдалена на гроб рано,док још бијаше мрак, и видје да је камен дигнут са гроба." (Јован 20:1)',
    izvor: 'Јован 20:1'
  },
  {
    naslov: 'Исус се јавља ученицима',
    tekst: '"А Исус им рече опет: Мир ван! Као што је Отац послао мене, и ја шаљем вас." (Јован 20:21)',
    izvor: 'Јован 20:21'
  },
  {
    naslov: 'Тома и васкрсли Христос',
    tekst: '"Затим рече томи: Пружи прст свој и амо и види руке моје;и пружи рулу своју и метни у ребра моја, и не буди не веран него веран." (Јован 20:27)',
    izvor: 'Јован 20:27'
  },
  {
    naslov: 'Победа над смрћу',
    tekst: '"Христос Воскресе из мертвих смертију смерт поправ исушчим во гробјем живот даровав." (Тропар Васкрсу)',
    izvor: 'Тропар Васкрсу'
  },
  {
    naslov: 'Живот после Васкрса',
    tekst: '"Истина је реч ако с Њим умријесмо, с Њим и живјесмо." (2. Тимотеју 2:11)',
    izvor: '2. Тимотеју 2:11'
  },
  {
  naslov: 'Исус је васкрсење и живот',
  tekst: '"Исус јој рече: Ја сам Васкрссење и живот;који верује у мене ако умре живеће. " (Јован 11:25)',
  izvor: 'Јован11:25'
},
  {
    naslov: 'Господ је заиста васкрсао',
    tekst: '"Који говораху: Заиста устаде Господ , и јави се Симону." (Лука 24:34)',
    izvor: 'Лука24:34'
  }
];



const Vaskrs = () => {
  return (
    <div className="container">
      <h2 className="my-4 text-center text-white">Васкрсење Христово</h2>
      <Row xs={1} sm={2} md={3} lg={4} className="g-4">
        {stihovi.map((stih, index) => (
          <Col key={index}>
            <Card className="bg-dark text-white h-100">
              <Card.Header>{stih.naslov}</Card.Header>
              <Card.Body>
                <p>{stih.tekst}</p>
              </Card.Body>
              <Card.Footer>{stih.izvor}</Card.Footer>
            </Card>
          </Col>
        ))}
      </Row>
    </div>
  );
};

export default Vaskrs;
