import React from 'react';
import { Card, Row, Col } from 'react-bootstrap';
import './Genesis.css'
const stihovi = [

  {
    naslov: 'Рођење Светог Јована Крститеља',
    tekst: '"И одмах му се отворише уста његова и језик његов и говораше благосиљајући Бога" (Лука 1:64)',
    izvor: 'Лука 1:64'
  },
  {
    naslov: 'Христово сведочење о Светом Јовану ',
    tekst: '"Заиста вам кажем: Међу рођенима од жена није се појавио већи од Јована Крститеља;а најмањи у Царству Небеском већи је од њега." (Матеј 11:11)',
    izvor: 'Матеј 11:11'
  },
  {
    naslov: 'Храброст Светог Јована Крститеља',
    tekst: '"Јер Јован говораше Ироду:Не можеш имати жену брата својега.\'" (Marko 6:18)',
    izvor: 'Марко 6:18'
  },
  {
    naslov: 'Мисија Светог Јована',
    tekst: '"И говораше: Покајте се јер се приближило Царство Небеско!\'" (Матеј 3:2)',
    izvor: 'Матеј 3:2'
  },
  {
    naslov: 'Крштење Христа',
    tekst: '"Тада дође Исус из Галилеје на Јордан Јовану да га овај крсти." (Матеј 3:13)',
    izvor: 'Матеј 3:13'
  },
  {
    naslov: 'Свети Јован и Спаситељ',
    tekst: '"А сутрадан видје Јован Исуса где долази к њему и рече:Гле, јагње божије које узима на се гријехе овога свијета." (Јован 1:29)',
    izvor: 'Јован 1:29'
  },
  {
    naslov: 'Јованов позив',
    tekst: '"Тада излажаше к њему Јерусалим и сва Јудеја и сва околина јорданска." (Матеј3:5)',
    izvor: 'Матеј 3:5'
  },
  {
    naslov: 'Јованова оданост Богу',
    tekst: '"Ја вас крштавам водом за покајање;а онај што долази за мном јачи је од мене ја нисам достојан његове обуће донети;он ће вас крстити Духом Светим." (Матеј 3:11)',
    izvor: 'Матеј 3:11'
  },
  {
    naslov: 'Јованова проповед',
    tekst: '"Родите дакле род достојан покајања" (Матеј 3:8)',
    izvor: 'Матеј3:8'
  },
  {
    naslov: 'Јован о Христу',
    tekst: '"Ово је онај за кога ја рекох: За мном долази који предамном би, јер прије мене беше." (Јован 1:31)',
    izvor: 'Јован 1:30'
  }

];

const SvetiJovanKrstitelj = () => {
  return (
    <div className="container">
      <h2 className="my-4 text-center text-white">Свети Јован Крститељ</h2>
      <Row xs={1} sm={2} md={3} lg={4} className="g-4">
        {stihovi.map((stih, index) => (
          <Col key={index}>
            <Card className="bg-dark text-white h-100">
              <Card.Header>{stih.naslov}</Card.Header>
              <Card.Body>
                <p>{stih.tekst}</p>
              </Card.Body>
              <Card.Footer>{stih.izvor}</Card.Footer>
            </Card>
          </Col>
        ))}
      </Row>
    </div>
  );
};

export default SvetiJovanKrstitelj;
