import React from 'react';
import { Card, Row, Col } from 'react-bootstrap';
import '../App.css'
const cuda = [
  {
    naslov: 'Исцељење слепих',
    tekst: '"Тада се дохвати очију његових говорећи: по вјери вашој нека вам буде.\'" (Матеј 9:29)',
    izvor: 'Матеј9:29'
  },
  {
    naslov: 'Претварање воде у вино',
    tekst: '"А кад окуси пехарник вино које је постало од воде,и не знађашеоткуда је, а слуге знадијаху које су захватиле воду,позва пехарник женика." (Јован 2:9)',
    izvor: 'Јован 2:9'
  },
  {
    naslov: 'Ход по води',
    tekst: '"А у четврту стражу ноћи отиде к њима Исус ходећи по мору." (Матеј 14:25)',
    izvor: 'Матеј 14:25'
  },
  {
    naslov: 'Васкрсење Лазарево',
    tekst: '"И ово рекавши викну громким гласом:Лазаре, изиђи напоље." (Јован 11:43)',
    izvor: 'Јован 11:43'
  },
  {
    naslov: 'Умножавање хлеба и рибе',
    tekst: '"И једоше сви и наситише се, и накуше комада што претече ддванаест котарица пуних." (Матеј 14:20)',
    izvor: 'Матеј 14:20'
  },
  {
    naslov: 'Исцељење жене која је крварила',
    tekst: '"А, он јој рече: Не бој се кћери вјера твоја спсла те је;иди у миру" (Лука 8:48)',
    izvor: 'Лука 8:48'
  },
  {
    naslov: 'Смиривање олује',
    tekst: '"и приступивши пробудише га говорећи: Учитељу,учитељу, изгибосмо! А он устаде, и запријети вјетру и валовима воденим, и престадоше и наста тишина." (Лука 8:24)',
    izvor: 'Лука 8:24'
  },
  {
    naslov: 'Исцељење одузетога',
    tekst: '"Теби говорим: Устани и узми одар свој, и иди дому своме" (Марко 2:11)',
    izvor: 'Марко 2:11'
  },
  {
    naslov: 'Исцељење глувог и немог',
    tekst: '"И одмах му се отвори слух, а радријеши се свеза језика његова, и говораше правилно.\'" (Марко 7:35)',
    izvor: 'Марко 7:35'
  },
  {
    naslov: 'Исцељење десет лепроса',
    tekst: '"И подигоше глас говорећи: Исуссе, Учитељу,помилуј нас!" (Лука 17:13)',
    izvor: 'Лука 17:13'
  }
];

const HristovaCuda = () => {
  return (
    <div className="container">
      <h2 className="my-4 text-center text-white">Христова чуда</h2>
      <Row xs={1} sm={2} md={3} lg={4} className="g-4">
        {cuda.map((cudo, index) => (
          <Col key={index}>
            <Card className="bg-dark text-white h-100">
              <Card.Header>{cudo.naslov}</Card.Header>
              <Card.Body>
                <p>{cudo.tekst}</p>
              </Card.Body>
              <Card.Footer>{cudo.izvor}</Card.Footer>
            </Card>
          </Col>
        ))}
      </Row>
    </div>
  );
};

export default HristovaCuda;
